package arithmeticOperations;

/*
* В некоторой школе занятия начинаются в 9:00. Продолжительность урока — 45 минут,
* после 1-го, 3-го, 5-го и т.д. уроков перемена 5 минут, а после 2-го, 4-го, 6-го и т.д
*  — 15 минут. Определите, когда заканчивается указанный урок.

Входные данные
Дан номер урока (число от 1 до 10).

Выходные данные
Выведите два целых числа: время окончания урока в часах и минутах.
* При решении этой задачи нельзя пользоваться циклами и условными инструкциями.
* */

import java.util.Scanner;

public class EndOfClasses {
    public static void main(String[] args) {
//        Scanner scanner = new Scanner(System.in);
//        int numClasses = scanner.nextInt();
//        // TO DO: Нужно разобрать, не понял как найти
        int a = -1 % 36;

        System.out.println(a);
    }
}
